## Chapter 5: Starting with Pandas

In [1]:
import numpy as np
import pandas as pd

`Series`: una serie es un objeto similar a una matriz unidimensional que contiene una
secuencia de valores. La serie más simple se forma a partir de una sola matriz de datos:

In [2]:
obj = pd.Series([4, 7, -5, 8])
obj

0    4
1    7
2   -5
3    8
dtype: int64

In [3]:
# se puede obtener la representación de arrays e index
obj.array

<PandasArray>
[4, 7, -5, 8]
Length: 4, dtype: int64

In [4]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
# crear una serie con etiquetas
obj2 = pd.Series([4, 7, -5, 8], index=["d", "b", "a", "c"])
obj2

d    4
b    7
a   -5
c    8
dtype: int64

In [8]:
obj2["a"]

-5

In [9]:
obj2["d"] = 6
obj2

d    6
b    7
a   -5
c    8
dtype: int64

In [10]:
obj2[obj2 > 0]

d    6
b    7
c    8
dtype: int64

In [11]:
obj2 * 2

d    12
b    14
a   -10
c    16
dtype: int64

In [12]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c    2980.957987
dtype: float64

In [13]:
# otra forma de pensar acerca de un series es como un diccionario ordenado de
# longitud fija
"b" in obj2

True

In [14]:
# crear una serie a partir de un diccionario
sdata = {"Ohio": 35_000, "Texas": 71_000, "Oregon": 16_000, "Utha": 5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utha       5000
dtype: int64

In [16]:
# una serie se puede volver a convertir a un diccioanrio
obj3.to_dict()

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utha': 5000}

In [19]:
"""
pasar un diccionario respeta el orden, se puede anular pasando un index
en el orden deseado
"""
states = ["California", "Ohio", "Oregon", "Texas"]
obj4 = pd.Series(sdata, states)
obj4 # California se agrega, pero su valor es NaN

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [20]:
pd.isna(obj4) # or obj4.insa()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [21]:
pd.notna(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

una caracterísitca útil es que se alinea  automáticamente por etiqueda de índice en operaciones aritméticas.

In [22]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utha       5000
dtype: int64

In [23]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [24]:
obj4 + obj3

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utha               NaN
dtype: float64

Tanto el objeto `Series` como su índice tienen un atributo `name`.

In [25]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [26]:
obj4.name = "population"
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [27]:
obj4.index.name = "state"
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

El indeice de una serie se puede modificar con la asignación:

In [44]:
obj

0    4
1    7
2   -5
3    8
dtype: int64

In [45]:
obj.index = ["Bob", "Steven", "Jeff", "Ryan"]
obj

Bob       4
Steven    7
Jeff     -5
Ryan      8
dtype: int64

#### Marco de datos (DataFrame)
Un DataFrame representa una tabla rectangular de datos y contiene una colección
ordenada y con nombres de columna, cada una de las cuales puede ser un tipo de valor
diferente. El Dataframe tiene un índice de fila y columna; se puede considerar como
un diccionario de series que comparten el mismo índice.

Hay muchas maneras de crear un DataFrame, aunque una de las más comunes es usar un
diccionario:

In [28]:
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
       "year": [2000, 2001, 2002, 2001, 2002, 2003],
       "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [29]:
# el método head selecciona las primeras 5 filas
frame.head() # or frame.head(int)

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [30]:
frame.tail() # retorna las últimas 5 filas

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

Si especifica una secuencia de columnas, las columnas del DataFrame serán colocadas en
ese orden:

In [46]:
pd.DataFrame(data, columns=["year", "state", "pop"])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

Pasar una columna que no está contenida en el diccionario aparecera con valores fatantes.

In [32]:
frame2 = pd.DataFrame(data, columns=["year", "state", "pop", "debt"])
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [47]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

Se puede recuperar una columna por notación de diccionario o punto:

In [33]:
frame2["year"]

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [34]:
frame2.year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

Se puede usar `iloc` y `loc` para recuperar las columnas:

In [35]:
frame2.loc[1]

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: 1, dtype: object

In [36]:
frame2.iloc[2]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: 2, dtype: object

Las columnas se pueden modificar por asignación:

In [41]:
frame2.debt = 16.5 # or frame2["debt"] = 16.5
frame2

   year   state  pop  debt
0  2000    Ohio  1.5  16.5
1  2001    Ohio  1.7  16.5
2  2002    Ohio  3.6  16.5
3  2001  Nevada  2.4  16.5
4  2002  Nevada  2.9  16.5
5  2003  Nevada  3.2  16.5

In [42]:
frame2.debt = np.arange(6.)
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   0.0
1  2001    Ohio  1.7   1.0
2  2002    Ohio  3.6   2.0
3  2001  Nevada  2.4   3.0
4  2002  Nevada  2.9   4.0
5  2003  Nevada  3.2   5.0

Pasar una serie se añade según su index:

In [48]:
val = pd.Series([-1.2, -1.5, -1.7], index=[2, 4, 5])
frame2["debt"] = val
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6  -1.2
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9  -1.5
5  2003  Nevada  3.2  -1.7

Usar `del` para eliminar una columna. No se puede usar la notación de punto para alterar
una columna:

In [49]:
frame2["eastern"] = frame2["state"] == "Ohio" # columna de booleanos
frame2

   year   state  pop  debt  eastern
0  2000    Ohio  1.5   NaN     True
1  2001    Ohio  1.7   NaN     True
2  2002    Ohio  3.6  -1.2     True
3  2001  Nevada  2.4   NaN    False
4  2002  Nevada  2.9  -1.5    False
5  2003  Nevada  3.2  -1.7    False

Otra forma común de datos es un diccionario anidado de diccionarios:

In [50]:
populations = {"Ohio": {2000: 1.5, 2001: 1.7, 2003: 3.6},
              "Nevada": {2001: 2.4, 2002: 2.9}}

Si el diccionario anidado se pasa al DataFrame, Pandas interpretara las claves externas
como columnas y las claves internas como índices de fila.

In [51]:
frame3 = pd.DataFrame(populations)
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2003   3.6     NaN
2002   NaN     2.9

In [52]:
# transponer un DataFrame
frame3.T

        2000  2001  2003  2002
Ohio     1.5   1.7   3.6   NaN
Nevada   NaN   2.4   NaN   2.9

Las claves internas de un diccionario se combinan para formar el índice de resultado,
esto no es cierto si se especifica un índice explícito.

In [53]:
pd.DataFrame(populations, index=[2001, 2002, 2003])

      Ohio  Nevada
2001   1.7     2.4
2002   NaN     2.9
2003   3.6     NaN

Los diccionarios de serie se tratan de la misma manera.

In [54]:
pdata = {"Ohio": frame3["Ohio"][:-1],
        "Nevada": frame3["Nevada"][:2]}
pd.DataFrame(pdata)

/tmp/ipykernel_7043/1104899618.py:1: FutureWarning: The behavior of `series[i:j]` with an integer-dtype index is deprecated. In a future version, this will be treated as *label-based* indexing, consistent with e.g. `series[i]` lookups. To retain the old behavior, use `series.iloc[i:j]`. To get the future behavior, use `series.loc[i:j]`.
  pdata = {"Ohio": frame3["Ohio"][:-1],
/tmp/ipykernel_7043/1104899618.py:2: FutureWarning: The behavior of `series[i:j]` with an integer-dtype index is deprecated. In a future version, this will be treated as *label-based* indexing, consistent with e.g. `series[i]` lookups. To retain the old behavior, use `series.iloc[i:j]`. To get the future behavior, use `series.loc[i:j]`.
  "Nevada": frame3["Nevada"][:2]}

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2003   3.6     NaN

In [55]:
# check
frame3.index.name = "year"
frame3.columns.name = "state"
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2003    3.6     NaN
2002    NaN     2.9

A diferencia de las series, los DataFrame no tienen un atributo `name`.

Si las columnas del DataFrame son diferentes tipos de datos, se elegirá el tipo de dato
de la matriz devuelta para acomodar todas las columnas:

In [56]:
frame.to_numpy()

array([['Ohio', 2000, 1.5],
       ['Ohio', 2001, 1.7],
       ['Ohio', 2002, 3.6],
       ['Nevada', 2001, 2.4],
       ['Nevada', 2002, 2.9],
       ['Nevada', 2003, 3.2]], dtype=object)

### Índice de objetos